darlanalves/snes9x_esp32/components/lcd/lcd_panel_dpi.c
/*
 * SPDX-FileCopyrightText: 2023-2024 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
 
#include <sys/param.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "soc/soc_caps.h"
#include "esp_check.h"
#include "esp_lcd_panel_interface.h"
#include "esp_lcd_mipi_dsi.h"
#include "esp_clk_tree.h"
#include "esp_cache.h"
#include "mipi_dsi_priv.h"
#include "esp_memory_utils.h"
#include "esp_private/dw_gdma.h"
#include "esp_private/esp_clk_tree_common.h"
#include "hal/cache_hal.h"
#include "hal/cache_ll.h"
#include "hal/color_hal.h"

static const char *DSITAG = "lcd.dsi.dpi";

typedef struct esp_lcd_dpi_panel_t esp_lcd_dpi_panel_t;

static esp_err_t dpi_panel_del(esp_lcd_panel_t *panel);
static esp_err_t dpi_panel_init(esp_lcd_panel_t *panel);

volatile int linenums = 0;

struct esp_lcd_dpi_panel_t {
    esp_lcd_panel_t base;         // Base class of generic lcd panel
    esp_lcd_dsi_bus_handle_t bus; // DSI bus handle
    uint8_t virtual_channel;      // Virtual channel ID, index from 0
    uint8_t cur_fb_index;         // Current frame buffer index
    uint8_t num_fbs;              // Number of frame buffers
    uint8_t *fbs[DPI_PANEL_MAX_FB_NUM]; // Frame buffers
    uint32_t h_pixels;            // Horizontal pixels
    uint32_t v_pixels;            // Vertical pixels
    size_t fb_size;               // Frame buffer size, in bytes
    size_t bits_per_pixel;        // Bits per pixel
    lcd_color_format_t in_color_format;  // Input color format
    lcd_color_format_t out_color_format; // Output color format
    dw_gdma_channel_handle_t dma_chan;    // DMA channel
    dw_gdma_link_list_handle_t link_lists[DPI_PANEL_MAX_FB_NUM]; // DMA link list
    //esp_async_fbcpy_handle_t fbcpy_handle; // Use DMA2D to do frame buffer copy
    SemaphoreHandle_t draw_sem;            // A semaphore used to synchronize the draw operations when DMA2D is used
    esp_pm_lock_handle_t pm_lock;          // Power management lock
    esp_lcd_dpi_panel_color_trans_done_cb_t on_color_trans_done; // Callback invoked when color data transfer has finished
    esp_lcd_dpi_panel_refresh_done_cb_t on_refresh_done; // Callback invoked when one refresh operation finished (kinda like a vsync end)
    void *user_ctx; // User context for the callback
    int lcd_scaling_factor;
};

IRAM_ATTR
static bool dma_trans_done_cb(dw_gdma_channel_handle_t chan, const dw_gdma_trans_done_event_data_t *event_data, void *user_data)
{
    //portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;
    //taskENTER_CRITICAL(&mux);

    bool yield_needed = false;
    esp_lcd_dpi_panel_t *dpi_panel = (esp_lcd_dpi_panel_t *)user_data;
    mipi_dsi_hal_context_t *hal = &dpi_panel->bus->hal;
    uint8_t fb_index = dpi_panel->cur_fb_index;
    uint32_t returnvalue;

    returnvalue = fb_index;

    fb_index++;
    if (fb_index == dpi_panel->num_fbs)
      fb_index = 0;
      
    dpi_panel->cur_fb_index = fb_index;

    // clear the interrupt status
    uint32_t error_status = mipi_dsi_brg_ll_get_interrupt_status(hal->bridge);
    mipi_dsi_brg_ll_clear_interrupt_status(hal->bridge, error_status);
        if (unlikely(error_status & MIPI_DSI_LL_EVENT_UNDERRUN)) {
        // when an underrun happens, the LCD display may already becomes blue
        // it's too late to recover the display, so we just print an error message
        // as a hint to the user that he should optimize the memory bandwidth (with AXI-ICM)
        //ESP_DRAM_LOGE(DSITAG, "can't fetch data from external memory fast enough, underrun happens");

        // fcipaq: if a buffer unterrun of the MIPI tx buffer occured, the MIPI driver will issue a 
        // vsync event and the whole frame has to be scanned out again.
        // telling the scaler via "returnvalue": 0: no error; 1: vsync
        // TODO: make this into a nice structure
        returnvalue |= 0b100000000;
        linenums = 0;
    }

    // restart the DMA transfer, keep refreshing the LCD
    dw_gdma_link_list_handle_t link_list = dpi_panel->link_lists[fb_index];

    dw_gdma_block_markers_t markers = {
        .is_valid = true,
        .is_last = false,
    };

    for (int j = 0; j < dpi_panel->lcd_scaling_factor; j++) {
        if (j == dpi_panel->lcd_scaling_factor - 1)
          markers.is_last = true;
        dw_gdma_lli_set_block_markers(dw_gdma_link_list_get_item(link_list, j), markers);
    }

    dw_gdma_channel_use_link_list(chan, link_list);
    dw_gdma_channel_enable_ctrl(chan, true);  // fcipaq: rearm DMA

    // the DMA descriptor is large enough to carry a whole frame buffer, so this event can also be treated as a fake "vsync end"  
    // fcipaq: the above no longer applies. TODO: find a way to get a "real" vsync end event
    if (dpi_panel->on_refresh_done) {
//        if (dpi_panel->on_refresh_done(&dpi_panel->base, NULL, dpi_panel->user_ctx)) {
        if (dpi_panel->on_refresh_done(&dpi_panel->base, NULL, (void*) returnvalue)) {
            linenums++;
            if (linenums == dpi_panel->v_pixels / dpi_panel->lcd_scaling_factor) {
              linenums = 0;
              yield_needed = true;
            }
        }
    }

    //taskEXIT_CRITICAL(&mux);

    return yield_needed;
}

// Please note, errors happened in this function is just propagated to the caller
// dpi_panel_del() is actually doing the error handling
static esp_err_t dpi_panel_create_dma_link(esp_lcd_dpi_panel_t *dpi_panel)
{
    dw_gdma_channel_handle_t dma_chan = NULL;
    dw_gdma_link_list_handle_t link_list = NULL;
    // sending image stream from memory to the DSI bridge
    dw_gdma_channel_alloc_config_t dma_alloc_config = {
        .src = {
            .block_transfer_type = DW_GDMA_BLOCK_TRANSFER_LIST,
            .role = DW_GDMA_ROLE_MEM,
            .handshake_type = DW_GDMA_HANDSHAKE_HW,
            .num_outstanding_requests = 5,
        },
        .dst = {
            .block_transfer_type = DW_GDMA_BLOCK_TRANSFER_LIST,
            .role = DW_GDMA_ROLE_PERIPH_DSI,
            .handshake_type = DW_GDMA_HANDSHAKE_HW,
            .num_outstanding_requests = 2,
        },
        .flow_controller = DW_GDMA_FLOW_CTRL_SELF, // DMA as the flow controller
        .chan_priority = 1,
    };
    ESP_RETURN_ON_ERROR(dw_gdma_new_channel(&dma_alloc_config, &dma_chan), DSITAG, "create DMA channel failed");
    dpi_panel->dma_chan = dma_chan;

